# Задача об обработке списка: 
# Напишите функцию на Python, которая принимает список чисел и возвращает новый список, содержащий только уникальные числа из исходного списка в том же порядке. Например, для списка [1, 2, 5, 2, 3, 1, 4, 5] ваша функция должна вернуть список [1, 2, 5, 3, 4].

# Задача "Конвертер Температуры": 
# Напишите функцию convert_temperature, которая принимает два аргумента: число (температура) и строку (единица измерения: 'C' для Цельсия, 'F' для Фаренгейта). Функция должна конвертировать температуру из Цельсия в Фаренгейты и наоборот. Формулы конвертации: C = (F - 32) * 5/9 и F = C * 9/5 + 32.

# Задача "Поиск Слова в Тексте": 
# Напишите функцию find_word, которая принимает два аргумента: текст (строка) и слово (строка), и возвращает количество раз, которое это слово встречается в тексте. Учтите, что поиск должен быть нечувствителен к регистру. Например, find_word("Hello world, hello Python", "hello") должна возвращать 2.

# 1
a = [1, 2, 5, 2, 3, 1, 4, 5]
c = set(a)
print(c)


# def convert_temperature(num, c):
#     c = (F - 32) * 5/9

# def find_word(text, string):
    

